app/views/blogs/_add_comments.html.erb

<% @blog.comments&.order(id:"desc").each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`blog_id` = 2 ORDER BY `comments`.`id` DESC