app/views/admin/permissions/_add_roles.html.erb


    <% Role.all.each do |role|%>
	    <label class="checkbox">
	      <%= check_box_tag "permission[role_ids][]",role.id,@permission.role_ids.include?(role.id )%> <%= role.name %>
---
SELECT `roles`.* FROM `roles`
SELECT `roles`.id FROM `roles` INNER JOIN `permissions_roles` ON `roles`.`id` = `permissions_roles`.`role_id` WHERE `permissions_roles`.`permission_id` = 1