app/controllers/admin/categories_controller.rb

  def index
    @q = SearchParams.new(params[:search_params] || {})
    @categories = Category.default_where(@q.attributes(self)).page(params[:page]).per(10)
---
SELECT  `categories`.* FROM `categories` WHERE (categories.name like '%my%') LIMIT 10 OFFSET 0

  def show_name
    @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

  def create
    @category = Category.new(category_params)
    @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('mytest', '2017-07-30 18:24:26', '2017-07-30 18:24:26')

  def update
    @category.update(category_params)
---
UPDATE `categories` SET `parent_id` = 3, `name` = 'mytest1', `updated_at` = '2017-07-30 18:29:28' WHERE `categories`.`id` = 3