app/controllers/admin/comments_controller.rb

  def index
   # @comments = Comment.all
    @q = SearchParams.new(params[:search_params] || {})
    @comments = Comment.default_where(@q.attributes(self)).page(params[:page]).per(10)
---
SELECT  `comments`.* FROM `comments` WHERE (comments.content like '%da%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `comments`

  def create
    @comment = Comment.new(comment_params)
    @comment.save
---
INSERT INTO `comments` (`content`, `blog_id`) VALUES ('daffaadga', 2)

  def update
     @comment.update(comment_params)
---
UPDATE `comments` SET `content` = 'mytest' WHERE `comments`.`id` = 1

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1