app/controllers/admin/permissions_controller.rb

  def index
    @q = SearchParams.new(params[:search_params] || {})
    @permissions = Permission.default_where(@q.attributes(self)).page(params[:page]).per(10)
---
SELECT  `permissions`.* FROM `permissions` LIMIT 10 OFFSET 0

  def add_roles
    @permission = Permission.find(params[:id])
---
SELECT  `permissions`.* FROM `permissions` WHERE `permissions`.`id` = 1 LIMIT 1

  def save_roles
    @permission = Permission.find(params[:id])
---
SELECT  `permissions`.* FROM `permissions` WHERE `permissions`.`id` = 1 LIMIT 1