app/controllers/admin/roles_controller.rb

SELECT  `roles`.* FROM `roles` LIMIT 10 OFFSET 0
---
  def index
    @q = SearchParams.new(params[:search_params] || {})
    @roles = Role.default_where(@q.attributes(self)).page(params[:page]).per(10)

SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
---
  def add_permissions
    @role = Role.find(params[:id])

SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
---
  def save_permissions
    @role = Role.find(params[:id])

SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
---
    def set_role
      @role = Role.find(params[:id])