app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`title` = ''
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`category_id` = 1 LIMIT 10 OFFSET 0
SELECT  `blogs`.* FROM `blogs` LIMIT 11
SELECT COUNT(*) FROM `blogs`
---
  def index
    if params[:title]
      @blogs = Blog.where("title like ? ","%#{params[:title]}%").page(params[:page]).per(10)
    elsif params[:category_id]
      @blogs = Blog.where(category_id:params[:category_id]).page(params[:page]).per(10)
    else
      @blogs = Blog.all.page(params[:page]).per(10)

SELECT  `blogs`.* FROM `blogs` WHERE (title like 'a%' ) LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM `blogs` WHERE (title like '%' )
---
  def top_search
    @blogs = Blog.where("title like '#{params[:title]}%' ").page(params[:page]).per(9)

INSERT INTO `comments` (`content`, `blog_id`) VALUES ('xd', 4)
---
  def add_comments
    Comment.create(blog_id:@blog.id,content:params[:comment_text])

UPDATE `blogs` SET `view_count` = 1, `updated_at` = '2017-07-30 18:32:36' WHERE `blogs`.`id` = 2
---
  def show
    @blog.update(view_count: @blog.view_count.to_i + 1)

INSERT INTO `blogs` (`title`, `content`, `created_at`, `updated_at`) VALUES ('test2', 'alkjflak', '2017-07-23 16:16:46', '2017-07-23 16:16:46')
---
  def create
    @blog = Blog.new(blog_params)
    respond_to do |format|
      if @blog.save

UPDATE `blogs` SET `category_id` = 2, `content` = 'alsakjdflaksjdfl;ajfa<p><br></p>', `updated_at` = '2017-07-29 16:52:36' WHERE `blogs`.`id` = 4
INSERT INTO `attachments` (`attachment_entity_type`, `attachment_entity_id`, `path`, `name`, `content_type`, `file_size`, `created_at`, `updated_at`, `created_by`) VALUES ('Blog', 26, 'QQ图片20170729151127.jpg', 'QQ图片20170729151127.jpg', 'image/jpeg', 31580, '2017-07-29 15:19:18', '2017-07-29 15:19:18', '1')
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)
        unless params[:draft_img].blank?
          attachment = Attachment.create(attachment_entity_type: "Blog",attachment_entity_id: @blog.id , path: params[:draft_img], created_by: 1 )

DELETE FROM `blogs` WHERE `blogs`.`id` = 1
---
  def destroy
    @blog.destroy

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 4 LIMIT 1
---
    def set_blog
      @blog = Blog.find(params[:id])